Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/supplementary_welfare_schemes/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Overview of the Supplementary Welfare Allowance Scheme Describes the Supplementary Welfare Allowance Scheme including the basic payment and supplements under the scheme
ga: Overview Document Forbhreathnú ar an Scéim Liúntas Forlíontach Leasa Shóisialaigh Tugann cuntas ar an Scéim Liúntas Forlíontach Leasa Shóisialaigh; lena n-áirítear, an bhuníocaíocht agus na fordheontais éagsúla de réir na scéime

source: Supplementary Welfare Allowance is a payment to people that have no income
ga: Liúntas Leasa Forlíontach é íocaíocht do dhaoine incháilithe atá gan ioncam

source: Outlines the conditions for entitlement to basic Supplementary Welfare Allowance including the means test
ga: Cur síos gairid ar na coinníollacha teidlíochta ar Liúntas Leasa Forlíontach lena n-áirítear an scrúdú maoine

source: Administration of the Supplementary Welfare Allowance Scheme
ga: Riar na Scéime Liúntais Leasa Fhorlíontaigh

source: Department of Social Protection representatives (formerly known as Community Welfare Officers (CWOs)) are responsible for the day to day administration of the Supplementary Welfare Allowance Scheme
ga: Tá ionadaithe na Roinne Coimirce Sóisialaí (tugadh Oifigigh Leasa Pobail (CWOanna) orthu roimhe seo) freagrach as riar laethúil na Scéime Liúntais Leasa Fhorlíontaigh

source: Find out about their role and responsibilities
ga: Is féidir leat níos mó faisnéise a fháil faoina bhfeidhm agus faoina gcuid freagrachtaí

source: Exceptional Needs Payments are paid to people who have essential, once-off and exceptional needs that they cannot meet out of their weekly income
ga: Cur síos ar na rialacha a bhaineann le hiarratas ar íocaíocht riachtanais eisceachtúil nó práinneach

source: It can be paid for funeral costs and fuel bills
ga: Áirítear cúnamh le costais na sochraide agus billí breosla

source: You must have little or no means
ga: Caithfidh tú bheith riachtanas práinneach agat nó bheith ar bheagán nó gan aon mhaoin chun an íocaíocht seo a fháil

source: Diet and heating supplements
ga: Forlíontaí téimh agus aiste bia

source: Additional weekly supplements for special diets and heating requirements are available under the Supplementary Welfare Allowance Scheme
ga: Tá forlíonta breise seachtainiúla do riachtanais speisialta teasa agus aistí bia ar fáil faoin Liúntas Breise Leasa

source: Mortgage Interest Supplement provides short-term support to help you pay your mortgage interest repayments
ga: Is íocaíocht é Forlíonadh Ús Morgáiste a dhéanann an Roinn Coimirce Sóisialaí

source: The Mortgage Interest Supplement scheme is closed to new entrants and no new applications will be accepted
ga: Soláthraíonn sé tacaíocht ghearrthéarmach chun cabhrú leat d’aisíocaíochtaí úis morgáiste a íoc

source: Calculating Mortgage Interest Supplement
ga: Conas Forlíonadh Ús Morgáiste a ríomh

source: Shows you how to calculate Mortgage Interest Supplement
ga: Léirítear na céimeanna a bhaineann leis an bhForlíonadh ús morgáiste atá agat a ríomh

source: If you are renting privately and having difficulty paying your rent, you may qualify for Rent Supplement. If you qualify for social housing support, you should apply for the Housing Assistance Payment instead
ga: B’fhéidir go mbeadh daoine a bhíonn ag fáil íocaíocht leas sóisialach incháilithe le haghaidh Forlíonta Cíosa lena chinntiú nach dtitfidh a n-ioncam faoi íosleibhéal tar éis dóibh a gcíos a íoc

source: Shows you the steps involved in calculating your Rent Supplement
ga: Léirítear na céimeanna a bhaineann leis an bhForlíonadh Cíosa atá agat a ríomh

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil

source: The Back to School Clothing and Footwear Allowance is paid each year to families on certain social welfare and other benefits
ga: Íoctar an Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil gach bliain le teaghlaigh atá ar íocaíochtaí áirithe leasa shóisialaigh agus sochair

source: The scheme helps families with the cost of sending children back to school.The scheme opens on 1 June 2016
ga: Cabhraíonn an scéim leo leis an gcostas a bhaineann le páistí a chur ar ais chuig an scoil

source: This document is in: Social Welfare > Social welfare payments > Families and children
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Íocaíochtaí Leasa Shóisialaigh le Teaghlaigh agus le Leanaí

source: Rent Supplement and changes to your circumstances
ga: Forlíonadh Cíosa agus athruithe ar do chúinsí

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"
